Tekla.Structures.Internal.ConnectUploads.IUploads
Represents an API to store/retrieve the Connect uploads.

Tekla.Structures.Internal.ConnectUploads.IUploads.AddUpload(Tekla.Structures.Internal.ConnectUploads.Upload)
Adds an upload.
upload: The upload to add.
Returns: true if the upload was added successfully; otherwise, false.

Tekla.Structures.Internal.ConnectUploads.IUploads.RemoveUpload(Tekla.Structures.Internal.ConnectUploads.Upload)
Removes an upload.
upload: The upload to add.
Returns: true if the upload was added successfully; otherwise, false.

Tekla.Structures.Internal.ConnectUploads.IUploads.GetUploadByNameAndConnectLocation(System.String,System.String)
Gets an upload by name and connect location.
name: The name of the upload.
connectLocation: The connect location of the upload.
Returns: The upload with the specified name and connect location, or null if no such upload exists.

Tekla.Structures.Internal.ConnectUploads.IUploads.GetUploadByNameLocalPathAndModelInstanceId(System.String,System.String,System.String)
Gets an upload by name and local path.
name: The name of the upload.
localPath: The local path of the upload.
modelInstanceId: The model instance id
Returns: The upload with the specified name and local path, or null if no such upload exists.

Tekla.Structures.Internal.ConnectUploads.IUploads.GetUploadByNameAndLocalPath(System.String,System.String)
Gets an upload by name and local path.
name: The name of the upload.
localPath: The local path of the upload.
Returns: The upload with the specified name and local path, or null if no such upload exists.